Test-1/0/air/Tambient
 
(
  (0 303.25)
  (3600 303.34999999999997)
);
