Test-1/0/air/U
FoamFile
{
  version    2.0;
  format    ascii;
  class    volVectorField;
  location    "0/air";
  object    U;
}
dimensions    [0 1 -1 0 0 0 0];
internalField    uniform (1 0 0);
boundaryField
{
  left
  {
    type    slip;
  }
  right
  {
    type    slip;
  }
  top
  {
    type    slip;
  }
  terrain
  {
    type    fixedValue;
    value    uniform (0 0 0);
  }
  back
  {
    type    inletOutlet;
    inletValue    uniform (0 0 0);
    value    uniform (1 0 0);
  }
  front
  {
    type    atmBoundaryLayerInletVelocity;
    Uref    1;
    Zref    10.0;
    zDir    (0 0 1);
    flowDir    (1 0 0);
    z0    uniform 1.0;
    zGround    uniform 0;
    value    $internalField;
  }
  buildings
  {
    type    fixedValue;
    value    uniform (0 0 0);
  }
}
