Test-1/0/air/cloudCover
 
(
  (0 0.7)
  (3600 0.9)
);
