Test-1/0/buildings/Ts
FoamFile
{
  version    2.0;
  format    ascii;
  class    volScalarField;
  location    "345600/leeward";
  object    Ts;
}
dimensions    [0 0 0 1 0 0 0];
internalField    uniform 293.15;
boundaryField
{
  buildings_to_air
  {
    type    compressible::CFDHAMsolidTemperatureCoupledMixed;
    qrNbr    qr;
    qsNbr    qs;
    value    uniform 303.25;
  }
  interior
  {
    type    compressible::CFDHAMsolidTemperatureTransferCoeffInterior;
    hcoeff    0.405;
    Tamb    "$FOAM_CASE/0/buildings/T_room.dat";
    value    uniform 293.15;
  }
  sides
  {
    type    zeroGradient;
  }
}
