Test-1/0/vegetation/qr
FoamFile
{
  version    2.0;
  format    ascii;
  class    volScalarField;
  location    "0/air";
  object    qr;
}
dimensions    [1 0 -3 0 0 0 0];
internalField    uniform 0;
boundaryField
{
  left
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 1;
    qro    uniform 0;
    value    uniform 0;
  }
  right
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 1;
    qro    uniform 0;
    value    uniform 0;
  }
  top
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 1;
    qro    uniform 0;
    value    uniform 0;
  }
  terrain
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 0.9;
    qro    uniform 0;
    value    uniform 0;
  }
  back
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 1;
    qro    uniform 0;
    value    uniform 0;
  }
  front
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 1;
    qro    uniform 0;
    value    uniform 0;
  }
  air_to_vegetation
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 0.9;
    qro    uniform 0;
    value    uniform 0;
  }
  buildings
  {
    type    greyDiffusiveRadiationViewFactor;
    emissivityMode    lookup;
    emissivity    uniform 0.9;
    qro    uniform 0;
    value    uniform 0;
  }
}
