Test-1/constant/sunPosVector
 
(
  (0 (0.2452203131004285 0.8645432041129429 0.4386707720660838))
  (3600 (0.16163412845497616 0.7556750603820163 0.6346885942217935))
);
