Test-1/constant/vegetation/viewFactorsDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    viewFactorsDict;
}
writeFacesAgglomeration    true;
writeViewFactorMatrix    true;
debug    1;
dumpRays    false;
maxDynListLength    10000000;
skyPosVector    (0 0 1);
left
{
  nFacesInCoarsestLevel    10;
  featureAngle    10;
}
right
{
  nFacesInCoarsestLevel    10;
  featureAngle    10;
}
back
{
  nFacesInCoarsestLevel    10;
  featureAngle    10;
}
front
{
  nFacesInCoarsestLevel    10;
  featureAngle    10;
}
top
{
  nFacesInCoarsestLevel    100;
  featureAngle    10;
}
buildings
{
  nFacesInCoarsestLevel    1400;
  featureAngle    10;
}
air_to_vegetation
{
  nFacesInCoarsestLevel    300;
  featureAngle    150;
}
terrain
{
  nFacesInCoarsestLevel    1000;
  featureAngle    10;
}
