Test-1/system/air/createPatchDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    createPatchDict;
}
patches
(
  {
    name    grass;
    patchInfo
    {
      type    wall;
    }
    constructFrom    set;
    set    f0;
  }
);
