Test-1/system/blockMeshDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    blockMeshDict;
}
convertToMeters    1;
vertices
(
  (-75 125 0)
  (-75 -75 0)
  (145 -75 0)
  (145 125 0)
  (-75 125 80)
  (-75 -75 80)
  (145 -75 80)
  (145 125 80)
);
blocks
(
  hex (0 1 2 3 4 5 6 7)
  (
    10
    11
    4
  )
  simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  left
  {
    type    patch;
    faces
    (
      (0 3 7 4)
    );
  }
  right
  {
    type    patch;
    faces
    (
      (1 5 6 2)
    );
  }
  back
  {
    type    patch;
    faces
    (
      (3 2 6 7)
    );
  }
  front
  {
    type    patch;
    faces
    (
      (0 4 5 1)
    );
  }
  terrain
  {
    type    wall;
    faces
    (
      (0 1 2 3)
    );
  }
  top
  {
    type    patch;
    faces
    (
      (4 7 6 5)
    );
  }
);
mergePatchPairs
(
);
