Test-1/system/buildings/decomposeParDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  note    "mesh decomposition control dictionary";
  location    "system";
  object    decomposeParDict;
}
method    scotch;
numberOfSubdomains    4;
scotchCoeffs
{
}
