Test-1/system/fvSolution
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    fvSolution;
}
solvers
{
  p
  {
    solver    GAMG;
    smoother    GaussSeidel;
    tolerance    1e-6;
    relTol    0.1;
  }
  "(U|k|omega|epsilon)"
  {
    solver    smoothSolver;
    smoother    symGaussSeidel;
    tolerance    1e-6;
    relTol    0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors    0;
  residualControl
  {
    p    1e-4;
    U    1e-4;
    "(k|omega|epsilon)"    1e-4;
    Tl    1e-4;
  }
}
potentialFlow
{
  nNonOrthogonalCorrectors    10;
}
relaxationFactors
{
  Tl    0.3;
  fields
  {
    p    0.3;
  }
  equations
  {
    U    0.7;
    "(k|omega|epsilon).*"    0.7;
  }
}
