Test-1/system/meshQualityDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    meshQualityDict;
}
#includeEtc    "caseDicts/mesh/generation/meshQualityDict.cfg";
minTetQuality    1E-12;
maxBoundarySkewness    4;
minTwist    0.01;
maxConcave    80;
maxInternalSkewness    4;
nSmoothScale    4;
errorReduction    0.75;
relaxed
{
  maxNonOrtho    75;
}
