Test-1/system/vegetation/changeDictionaryDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    changeDictionaryDict;
}
boundary
{
  left
  {
    type    mappedPatch;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    left;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  right
  {
    type    mappedPatch;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    right;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  back
  {
    type    mappedPatch;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    back;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  front
  {
    type    mappedPatch;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    front;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  top
  {
    type    mappedPatch;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    top;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  air_to_vegetation
  {
    type    mappedWall;
    sampleMode    nearestCell;
    sampleRegion    air;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  buildings
  {
    type    mappedWall;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    buildings;
    offsetMode    uniform;
    offset    (0 0 0);
  }
  terrain
  {
    type    mappedWall;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    terrain;
    offsetMode    uniform;
    offset    (0 0 0);
  }
}
